socialNetwork/runs/e2e-read-user-timelines-3-eBLP/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 18.994ms, rate sampling interval: 57ms
  Thread calibration: mean lat.: 18.917ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 18.977ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 19.316ms, rate sampling interval: 57ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    19.21ms    7.48ms  45.12ms   75.42%
    Req/Sec   252.53     67.73   421.00     67.99%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.65ms
 75.000%   22.29ms
 90.000%   29.09ms
 99.000%   45.12ms
 99.900%   58.81ms
 99.990%   72.19ms
 99.999%   75.97ms
100.000%   75.97ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.087     0.000000            1         1.00
      11.615     0.100000         2004         1.11
      13.239     0.200000         4010         1.25
      14.647     0.300000         6020         1.43
      16.159     0.400000         8022         1.67
      17.647     0.500000        10020         2.00
      18.463     0.550000        11022         2.22
      19.279     0.600000        12040         2.50
      20.127     0.650000        13025         2.86
      21.103     0.700000        14028         3.33
      22.287     0.750000        15028         4.00
      23.023     0.775000        15532         4.44
      23.871     0.800000        16028         5.00
      24.879     0.825000        16530         5.71
      26.127     0.850000        17031         6.67
      27.455     0.875000        17535         8.00
      28.223     0.887500        17785         8.89
      29.087     0.900000        18035        10.00
      29.967     0.912500        18284        11.43
      31.071     0.925000        18535        13.33
      32.271     0.937500        18785        16.00
      33.119     0.943750        18910        17.78
      33.919     0.950000        19041        20.00
      34.655     0.956250        19162        22.86
      35.647     0.962500        19285        26.67
      36.959     0.968750        19409        32.00
      37.663     0.971875        19472        35.56
      38.527     0.975000        19535        40.00
      39.487     0.978125        19597        45.71
      40.383     0.981250        19661        53.33
      41.759     0.984375        19722        64.00
      42.463     0.985938        19756        71.11
      43.455     0.987500        19785        80.00
      44.607     0.989062        19816        91.43
      45.439     0.990625        19851       106.67
      46.879     0.992188        19879       128.00
      47.647     0.992969        19896       142.22
      48.383     0.993750        19911       160.00
      49.407     0.994531        19926       182.86
      50.559     0.995313        19942       213.33
      51.135     0.996094        19957       256.00
      51.871     0.996484        19965       284.44
      52.799     0.996875        19973       320.00
      53.375     0.997266        19981       365.71
      54.751     0.997656        19990       426.67
      55.455     0.998047        19996       512.00
      55.999     0.998242        20000       568.89
      56.543     0.998437        20004       640.00
      57.119     0.998633        20008       731.43
      58.271     0.998828        20012       853.33
      59.647     0.999023        20016      1024.00
      60.223     0.999121        20018      1137.78
      60.735     0.999219        20020      1280.00
      61.535     0.999316        20022      1462.86
      63.423     0.999414        20024      1706.67
      65.471     0.999512        20026      2048.00
      67.263     0.999561        20027      2275.56
      67.903     0.999609        20028      2560.00
      68.223     0.999658        20029      2925.71
      68.671     0.999707        20030      3413.33
      69.951     0.999756        20031      4096.00
      69.951     0.999780        20031      4551.11
      71.743     0.999805        20032      5120.00
      71.743     0.999829        20032      5851.43
      72.191     0.999854        20033      6826.67
      72.191     0.999878        20033      8192.00
      72.191     0.999890        20033      9102.22
      74.111     0.999902        20034     10240.00
      74.111     0.999915        20034     11702.86
      74.111     0.999927        20034     13653.33
      74.111     0.999939        20034     16384.00
      74.111     0.999945        20034     18204.44
      75.967     0.999951        20035     20480.00
      75.967     1.000000        20035          inf
#[Mean    =       19.214, StdDeviation   =        7.480]
#[Max     =       75.904, Total count    =        20035]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29687 requests in 30.00s, 410.65MB read
Requests/sec:    989.64  
Transfer/sec:     13.69MB